# **Ejercicios de pair programming M칩dulo 2 Sprint 2**
## **Limpieza IV**
### **Valores Nulos**

In [23]:
import pandas as pd
import seaborn as sns
import numpy as np
import matplotlib.pyplot as plt
import sidetable

plt.rcParams["figure.figsize"] = (10,8)
pd.options.display.max_columns = None

Hip칩tesis

La edad, el trabajo, el estado civil, la educaci칩n, la situaci칩n de deuda y la forma de contacto pueden influir en la probabilidad de que un cliente acepte la oferta.

El n칰mero de veces que se ha contactado a un cliente en el pasado (campo campaign), el n칰mero de d칤as que han pasado desde el 칰ltimo contacto (campo pdays), y el resultado de la campa침a anterior (campo poutcome) pueden afectar la respuesta del cliente a una nueva oferta.

Las variables econ칩micas (tales como el 칤ndice de precios al consumidor (cons.price.idx), la tasa de variaci칩n del empleo (emp.var.rate), etc.) pueden influir en la probabilidad de que un cliente acepte la oferta.

Los clientes que ya tienen una hipoteca (housing) o un pr칠stamo (loan) pueden ser menos propensos a aceptar una nueva oferta, ya que podr칤an estar limitados financieramente.

Es el momento de ponernos a trabajar con los valores nulos 游눩游낗. 
A lo largo de este ejercicio de pair programming vamos a intentar eliminar los valores nulos de nuestras columnas. 
En la lecci칩n hemos aprendido varios m칠todos, nosotras os planteamos los ejercicios pero sentiros libres de usar el m칠todo que m치s se adapte a vuestras necesidades. Manos a la obra!

In [24]:
df = pd.read_csv('../datos/df_bank_clean2.csv', index_col = 0) 
df.sample(3)

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,"emp,var,rate","cons,price,idx","cons,conf,idx",euribor3m,"nr,employed",y,month_day_week,month,day_week
30698,33,administration,married,high school,NaN,yes,no,cellular,17,1,999,0,nonexistent,-1.8,92.893,-46.2,1.344,5099.1,no,"may, tue",may,tue
11697,52,technician,married,university degree,NaN,no,no,telephone,10,3,999,0,nonexistent,1.4,94.465,-41.8,4.959,5228.1,no,"jun, fri",jun,fri
22711,58,services,married,high school,no,no,no,cellular,155,5,999,0,nonexistent,1.4,93.444,-36.1,4.964,5228.1,no,"aug, fri",aug,fri

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 41176 entries, 0 to 41187
Data columns (total 22 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             41176 non-null  int64
 1   job             40846 non-null  object
 2   marital         41096 non-null  object
 3   education       39446 non-null  object
 4   default         32580 non-null  object
 5   housing         40186 non-null  object
 6   loan            40186 non-null  object
 7   contact         41176 non-null  object
 8   duration        41176 non-null  int64
 9   campaign        41176 non-null  int64
 10  pdays           41176 non-null  int64
 11  previous        41176 non-null  int64
 12  poutcome        41176 non-null  object
 13  emp,var,rate    41176 non-null  float64
 14  cons,price,idx  41176 non-null  float64
 15  cons,conf,idx   41176 non-null  float64
 16  euribor3m       41176 non-null  float64
 17  nr,employed     41176 non-null  float64
 18  y               41176 non-null  object
 19  month_day_week  41176 non-null  object
 20  month           41176 non-null  object
 21  day_week        41176 non-null  object
dtypes: float64(5), int64(5), object(12)
memory usage: 7.2+ MB

1. Lo primero que tenemos que evaluar es en que columnas tenemos nulos y que cantidad tenemos en cada una. 쮿ay alguna columna con una gran cantidad de nulos? En caso de que sea as칤 deberemos eliminarla.

In [26]:
df.stb.missing()

                missing  total    percent
default            8596  41176  20.876239
education          1730  41176   4.201477
housing             990  41176   2.404313
loan                990  41176   2.404313
job                 330  41176   0.801438
marital              80  41176   0.194288
age                   0  41176   0.000000
cons,price,idx        0  41176   0.000000
month                 0  41176   0.000000
month_day_week        0  41176   0.000000
y                     0  41176   0.000000
nr,employed           0  41176   0.000000
euribor3m             0  41176   0.000000
cons,conf,idx         0  41176   0.000000
previous              0  41176   0.000000
emp,var,rate          0  41176   0.000000
poutcome              0  41176   0.000000
pdays                 0  41176   0.000000
campaign              0  41176   0.000000
duration              0  41176   0.000000
contact               0  41176   0.000000
day_week              0  41176   0.000000

In [27]:
df["default"].unique()

array(['no', nan, 'yes'], dtype=object)

In [28]:
"""La columna que tiene mas nulos es "default". Consideramos que un 20% de nulos poodr칤a no justificar la eliminaci칩n 
y que se podr칤a generar una categor칤a "desconocido" pero para hacer lo que pide el ejercicio vamos a eliminarla al ser la que m치s nulos tiene."""

df.drop(["default"], axis = 1, inplace=True)

In [29]:
df.stb.missing()

                missing  total   percent
education          1730  41176  4.201477
housing             990  41176  2.404313
loan                990  41176  2.404313
job                 330  41176  0.801438
marital              80  41176  0.194288
age                   0  41176  0.000000
cons,price,idx        0  41176  0.000000
month                 0  41176  0.000000
month_day_week        0  41176  0.000000
y                     0  41176  0.000000
nr,employed           0  41176  0.000000
euribor3m             0  41176  0.000000
cons,conf,idx         0  41176  0.000000
previous              0  41176  0.000000
emp,var,rate          0  41176  0.000000
poutcome              0  41176  0.000000
pdays                 0  41176  0.000000
campaign              0  41176  0.000000
duration              0  41176  0.000000
contact               0  41176  0.000000
day_week              0  41176  0.000000

2. Es el momento de eliminar los nulos:
- Reemplazad los valores nulos de la columna age por la media de la edad, redondeada a dos decimales.
- Reemplazad los valores nulos de la columna duration por la mediana de la edad, redondeada a dos decimales.
- En relaci칩n a las columnas de education, default, housing y loan al tratarse de columnas de tipo categ칩rica, reemplazad los valores nulos por una nueva categ칩ria que se llame unknown.
- Reemplazad los valores nulos de las columna job y marital por el valor m치s frecuente (la moda).

In [30]:
# Edad no tiene nulos, duration tampoco.

In [31]:
df.head()

,age,job,marital,education,housing,loan,contact,duration,campaign,pdays,previous,poutcome,"emp,var,rate","cons,price,idx","cons,conf,idx",euribor3m,"nr,employed",y,month_day_week,month,day_week
0,56,housemaid,married,basic 4y,no,no,telephone,261,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,"may, mon",may,mon
1,57,services,married,high school,no,no,telephone,149,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,"may, mon",may,mon
2,37,services,married,high school,yes,no,telephone,226,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,"may, mon",may,mon
3,40,administration,married,basic 6y,no,no,telephone,151,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,"may, mon",may,mon
4,56,services,married,high school,no,yes,telephone,307,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,"may, mon",may,mon

In [32]:
list_cat = ["education", "housing", "loan"]

In [33]:
for i in list_cat:
    df[i].fillna("unknown", inplace = True)

In [36]:
df["housing"].unique()

array(['no', 'yes', 'unknown'], dtype=object)

In [37]:
df["loan"].unique()

array(['no', 'yes', 'unknown'], dtype=object)

In [38]:
df["education"].unique()

array(['basic 4y', 'high school', 'basic 6y', 'basic 9y',
       'professional course', 'unknown', 'university degree',
       'illiterate'], dtype=object)

In [44]:
#sacamos la moda de las categor칤as a sustituir
print(df["marital"].mode()[0])
print(df["job"].mode()[0])

married
administration

In [40]:
list_cat2 = ["job", "marital"]

In [41]:
for i in list_cat2:
    df[i].replace(np.nan, df[i].mode()[0], inplace = True)

In [45]:
print(df["marital"].unique())
print(df["job"].unique())

['married' 'single' 'divorced']
['housemaid' 'services' 'administration' 'blue-collar' 'technician'
 'retired' 'management' 'unemployed' 'self-employed' 'entrepreneur'
 'student']

In [46]:
df.stb.missing()

                missing  total  percent
age                   0  41176      0.0
poutcome              0  41176      0.0
month                 0  41176      0.0
month_day_week        0  41176      0.0
y                     0  41176      0.0
nr,employed           0  41176      0.0
euribor3m             0  41176      0.0
cons,conf,idx         0  41176      0.0
cons,price,idx        0  41176      0.0
emp,var,rate          0  41176      0.0
previous              0  41176      0.0
job                   0  41176      0.0
pdays                 0  41176      0.0
campaign              0  41176      0.0
duration              0  41176      0.0
contact               0  41176      0.0
loan                  0  41176      0.0
housing               0  41176      0.0
education             0  41176      0.0
marital               0  41176      0.0
day_week              0  41176      0.0

3. Guardad el csv.

In [47]:
df.to_csv("../datos/df_bank_not_nulls.csv")